In [1]:
# location => https://mitu.co.in/dataset
# data => Social_Network_Ads.csv

In [3]:
import pandas as pd
import numpy as np

In [20]:
df = pd.read_csv("Social_Network_Ads.csv")
df

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0          19000.0          0
1    15810944    Male  35.0          20000.0          0
2    15668575  Female  26.0          43000.0          0
3    15603246  Female  27.0          57000.0          0
4    15804002    Male  19.0          76000.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0          41000.0          1
396  15706071    Male  51.0          23000.0          1
397  15654296  Female  50.0          20000.0          1
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

[400 rows x 5 columns]

In [22]:
newdf = df.copy()

In [24]:
newdf.shape

(400, 5)

In [26]:
newdf.dtypes

User ID              int64
Gender              object
Age                float64
EstimatedSalary    float64
Purchased            int64
dtype: object

#### label encoding

In [29]:
from sklearn.preprocessing import LabelEncoder

In [31]:
le = LabelEncoder()

In [33]:
newdf["Gender"] = le.fit_transform(newdf["Gender"])

In [37]:
newdf.head()

    User ID  Gender   Age  EstimatedSalary  Purchased
0  15624510       1  19.0          19000.0          0
1  15810944       1  35.0          20000.0          0
2  15668575       0  26.0          43000.0          0
3  15603246       0  27.0          57000.0          0
4  15804002       1  19.0          76000.0          0

In [43]:
le.classes_

array(['Female', 'Male'], dtype=object)

#### One Hot Encoding

In [46]:
pd.get_dummies(df)

      User ID   Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0    15624510  19.0          19000.0          0              0            1
1    15810944  35.0          20000.0          0              0            1
2    15668575  26.0          43000.0          0              1            0
3    15603246  27.0          57000.0          0              1            0
4    15804002  19.0          76000.0          0              0            1
..        ...   ...              ...        ...            ...          ...
395  15691863  46.0          41000.0          1              1            0
396  15706071  51.0          23000.0          1              0            1
397  15654296  50.0          20000.0          1              1            0
398  15755018  36.0          33000.0          0              0            1
399  15594041  49.0          36000.0          1              1            0

[400 rows x 6 columns]